{
  "mensagens": {
    "SyntaxError": {
      "mensagens": [
        "Parece que você está cometendo alguns erros por escrever as instruções de programação de forma incorreta.",
        "Leia a mensagem que aparece no seu console, ela irá ajudá-lo a corrigir o problema",
        "Se ainda assim você estiver com dúvidas, dá uma lida nesse material: <a href='http://35.208.64.26:2368/resolvendo-o-syntaxerror-no-python/' target='_blank'>Resolvendo o SyntaxError</a>"
      ]
    },
    "NameError": {
      "mensagens": [
        "Observei que você está cometendo alguns erros por causa da forma como está usando as variáveis",
        "Já leu as mensagens no console?",
        "Esse material também pode te ajudar: <a href='http://35.208.64.26:2368/resolvendo-os-erros/' target='_blank'>Resolvendo o NameError</a>"
      ]
    },
    "TypeError": {
      "mensagens": [
        "Ops... parece que você está com dificuldades em usar variáveis de tipos diferentes",
        "O seu console é seu amigo, dá uma lida nele para entender as causas do erro",
        "Também te recomendo um texto: <a href='http://35.208.64.26:2368/resolvendo-o-typeerror-no-python/' target='_blank'>Resolvendo o TypeError</a>"
      ]
    },
    "NameErrorParteDois": {
      "mensagens": [
        "Sugiro que leia alguns materiais sobre esse erro para ajudá-lo a resolver o problema:",
        "",
        "http://www.35.208.64.26:2368/resolvendo-os-erros/"
      ]
    },
    "saudacao": {
      "mensagens": ["Olá, meu nome é Davi e sou o seu monitor do curso de programação."]
    },
    "mensagemMotivacionalUm": {
      "mensagens": [
        "Olá, parece que você está com alguns probleminhas na programação",
        "Não se assuste, é normal... ",
        "Você está aprendendo algo novo e que sabemos, é difícil",
        "Não desista! Logo logo você encontrará a solução!"
      ]
    },
    "mensagemMotivacionalDois": {
      "mensagens": [
        "Programar tem dessas coisas...",
        "Os erros fazem parte do aprendizado e irão lhe ajudar no futuro",
        "Não é só você, seus colegas de turma também estão cometendo erros",
        "Foque em entender o que é o erro que está enfrentando, se precisar de ajuda, fala com o professor: leonardo.silva@garanhuns.ifpe.edu.br"
      ]
    },
    "mensagemMotivacionalTres": {
      "mensagens": [
        "Eu sei como é...",
        "já passei por esses problemas",
        "no começo bate o desespero quando o erro aparece...",
        "mais ainda quando ele não vai embora hehehe",
        "Mas não desista, é normal cometer erros, principalmente quando você está aprendendo",
        "Mantenha o foco que jaja você conseguirá resolver!"
      ]
    },
    "mensagemMotivacionalQuatro": {
      "mensagens": [
        "Eu sei como é...",
        "já passei por esses problemas",
        "no começo bate o desespero quando o erro aparece...",
        "mais ainda quando ele não vai embora hehehe",
        "Mas não desista, é normal cometer erros, principalmente quando você está aprendendo",
        "Mantenha o foco que jaja você conseguirá resolver!"
      ]
    }
  }
}
